{
  "contract_version": "1.0.0",
  "scope": "scripts/tools/",
  "description": "Contrato que toda herramienta (tool) en scripts/tools/ debe cumplir: salida JSON adecuada al fin de la herramienta y feedback estructurado.",
  "output": {
    "description": "Toda herramienta debe producir al finalizar un resultado en formato JSON, adecuado a su propósito.",
    "required_fields": {
      "toolId": "Identificador de la herramienta (kebab-case, ej. prepare-full-env).",
      "exitCode": "Código de salida numérico (0 = éxito, distinto de 0 = fallo).",
      "success": "Booleano: true si la ejecución fue correcta.",
      "timestamp": "ISO 8601 de finalización (UTC recomendado).",
      "message": "Mensaje breve de resumen (humano y máquina).",
      "feedback": "Array de entradas de feedback ordenadas cronológicamente."
    },
    "optional_fields": {
      "data": "Objeto libre con datos específicos del fin de la herramienta (servicios levantados, URLs, errores por fase, etc.).",
      "duration_ms": "Duración total de la ejecución en milisegundos."
    },
    "output_modes": [
      "Escribir el JSON en un fichero si se indica -OutputPath (o equivalente).",
      "Emitir el JSON por stdout si se indica -OutputJson o variable de entorno TOOLS_OUTPUT_JSON=1.",
      "En cualquier caso, el resultado interno debe poder serializarse según este esquema."
    ]
  },
  "feedback": {
    "description": "Las herramientas deben mantener un feedback adecuado: trazabilidad de fases, niveles y mensajes.",
    "rules": [
      "Cada fase o paso significativo debe generar al menos una entrada en feedback.",
      "En caso de error, debe existir una entrada con level 'error' que describa el fallo.",
      "Las advertencias (recursos no disponibles, timeouts parciales) deben registrarse con level 'warning'."
    ],
    "entry_schema": {
      "phase": "Identificador de la fase o paso (ej. docker, mysql, api, clients).",
      "level": "info | warning | error.",
      "message": "Texto breve y legible del evento.",
      "timestamp": "ISO 8601 del momento del evento."
    },
    "optional_per_entry": {
      "detail": "Texto adicional o código de error.",
      "duration_ms": "Duración del paso en ms."
    }
  },
  "required_artefacts_per_tool": [
    { "ext": ".ps1", "purpose": "Script PowerShell principal (o .bat que invoque .ps1)." },
    { "ext": ".json", "naming": "<tool-id>-config o prepare-env según herramienta", "purpose": "Configuración machine-readable cuando la herramienta sea parametrizable." },
    { "ext": ".md", "naming": "prepare-env.md o <tool-id>.md", "purpose": "Documentación de uso, parámetros y salida JSON. Idioma: es-ES." }
  ],
  "constraints": [
    "toolId en kebab-case.",
    "El JSON de salida debe ser válido y codificado en UTF-8.",
    "No escribir feedback sensible (contraseñas, tokens) en message ni en data.",
    "exitCode 0 únicamente cuando success es true; en caso de fallo, success false y exitCode != 0."
  ],
  "consumers": ["SddIA/actions/", "SddIA/agents/*.json", "scripts/", "CI/CD"]
}
